const license = `
## 1. 权利声明

本”软件”的一切知识产权，以及与"软件"相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图像、图表、色彩、界面设计、版面框架、有关数据、附加程序、印刷材料或电子文档等均为抽空查询团队所有，受著作权法和国际著作权条约以及其他知识产权法律法规的保护。

## 2. 权限范围

- 2-1. 本软件为免费软件，用户可以非商业性、无限制数量地下载、安装及使用本软件。
- 2-2. 本软件为免费软件，严禁其他单位或个人未经同意在本软件上进行二次开发。
- 2-3. 本协议未明示授权的其他一切权利仍归抽空查询团队所有，用户使用其他权利时必须获得同意。

## 3. 用户使用须知

- 3-1. 用户应在遵守法律及本协议的前提下使用本软件。用户无权实施包括但不限于下列行为：
  - 3-1-1. 不得删除或者改变本软件上的所有权利管理电子信息；
  - 3-1-2. 不得故意避开或者破坏著作权人为保护本软件著作权而采取的技术措施；
  - 3-1-3. 用户不得利用本软件误导、欺骗他人；
  - 3-1-4. 违反国家规定，对计算机信息系统功能进行删除、修改、增加、干扰，造成计算机信息系统不能正常运行；
  - 3-1-5. 未经允许，进入计算机信息网络或者使用计算机信息网络资源；
  - 3-1-6. 未经允许，对计算机信息网络功能进行删除、修改或者增加的；
  - 3-1-7. 未经允许，对计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加；
  - 3-1-8. 破坏本软件系统或网站的正常运行，故意传播计算机病毒等破坏性程序；
  - 3-1-9. 其他任何危害计算机信息网络安全的；
- 3-2. 本软件所有信息来源于山东理工大学各个平台，仅供查询。本软件获取各平台的许可，特此感谢各平台，除网上服务大厅及其相关组织和平台外：
  - 3-2-1. 校园卡 - 山东理工大学校园一卡通自助查询平台 http://211.64.27.136/SelfSearch/Default.aspx
  - 3-2-2. 宿舍电量 - 山东理工大学后勤服务大厅 http://hqfw.sdut.edu.cn/
  - 3-2-3. 宿舍卫生 - 山东理工大学网上服务大厅 http://ehall.sdut.edu.cn/new/ehall.html
  - 3-2-4. 成绩 - 山东理工大学教学综合信息服务平台 http://210.44.191.125/jwglxt/xtgl/index_initMenu.html
  - 3-2-5. 图书借阅 - 山东理工大学图书馆 http://222.206.65.12/reader/redr_info.php
- 3-3. 本软件不保存涉及用户隐私的各种信息，所有用户信息保存在用户所用设备上。

## 4. 免责声明
用户使用本软件前，请务必认真阅读用户须知中的各项条款。如果用户选择接受并继续使用本软件，则视为用户同意并认可抽空查询团队对用户因使用本软件功能所带来的风险与损害不承担任何责任。

`;

Page({

  /**
   * 页面的初始数据
   */
  data: {
    license,
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(_query: { [queryKey: string]: string }) {

  },
});
